#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.staging_db_password: Refreshing state... [id=none]
random_password.database_password: Refreshing state... [id=none]
google_project_service.iam: Refreshing state... [id=venture-capitol/iam.googleapis.com]
google_project_service.sql: Refreshing state... [id=venture-capitol/sqladmin.googleapis.com]
google_project_service.run: Refreshing state... [id=venture-capitol/run.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=venture-capitol/secretmanager.googleapis.com]
google_secret_manager_secret.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string]
google_secret_manager_secret.db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string]
google_service_account.backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/backend-sa@venture-capitol.iam.gserviceaccount.com]
google_sql_database_instance.vc_db: Refreshing state... [id=vc-backend-database]
google_secret_manager_secret_iam_binding.db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string/roles/secretmanager.secretAccessor]
google_project_iam_binding.service_permissions["cloudsql.client"]: Refreshing state... [id=venture-capitol/roles/cloudsql.client]
google_secret_manager_secret_iam_binding.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string/roles/secretmanager.secretAccessor]
google_project_iam_binding.service_permissions["run.admin"]: Refreshing state... [id=venture-capitol/roles/run.admin]
google_sql_user.database_user: Refreshing state... [id=backend_user//vc-backend-database]
google_sql_user.staging_database_user: Refreshing state... [id=staging_backend_user//vc-backend-database]
google_secret_manager_secret_version.db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/db_connection_string/versions/1]
google_sql_database.staging_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/staging_backend]
google_secret_manager_secret_version.staging_db_connection_string: Refreshing state... [id=projects/122736358705/secrets/staging_db_connection_string/versions/1]
google_sql_database.backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/backend]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend]
google_cloud_run_service.staging_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging]
google_cloud_run_domain_mapping.staging: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/domainmappings/staging.api.venturecapitol.de]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend]
google_cloud_run_domain_mapping.root: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/domainmappings/api.venturecapitol.de]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_cloud_run_service.backend has changed
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "vc-backend-v56jj" -> "vc-backend-5gtwx"
              ~ latest_ready_revision_name   = "vc-backend-v56jj" -> "vc-backend-5gtwx"
              ~ observed_generation          = 8 -> 9
                # (2 unchanged elements hidden)
            },
        ]
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              ~ "serving.knative.dev/lastModifier"  = "vc-cicd@venture-capitol.iam.gserviceaccount.com" -> "SkyGuardian42@gmail.com"
                # (5 unchanged elements hidden)
            }
          ~ generation       = 8 -> 9
          ~ resource_version = "AAXTG5yZvrU" -> "AAXTS9pAqos"
            # (4 unchanged attributes hidden)
        }

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:449949" -> "us-docker.pkg.dev/cloudrun/container/hello"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_service.staging_backend has changed
  ~ resource "google_cloud_run_service" "staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging"
        name                       = "vc-backend-staging"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "vc-backend-staging-n5jcw" -> "vc-backend-staging-pbmbd"
              ~ latest_ready_revision_name   = "vc-backend-staging-n5jcw" -> "vc-backend-staging-pbmbd"
              ~ observed_generation          = 6 -> 8
                # (2 unchanged elements hidden)
            },
        ]
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              ~ "serving.knative.dev/lastModifier"  = "vc-cicd@venture-capitol.iam.gserviceaccount.com" -> "SkyGuardian42@gmail.com"
                # (3 unchanged elements hidden)
            }
          ~ generation       = 6 -> 8
          ~ resource_version = "AAXTS0jnsfs" -> "AAXTS9ohONQ"
            # (4 unchanged attributes hidden)
        }

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:9297a1" -> "us-docker.pkg.dev/cloudrun/container/hello"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "us-docker.pkg.dev/cloudrun/container/hello" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:ac5651"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.staging_backend will be updated in-place
  ~ resource "google_cloud_run_service" "staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging"
        name                       = "vc-backend-staging"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "us-docker.pkg.dev/cloudrun/container/hello" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:ac5651"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_storage_bucket.frontend_staging will be created
  + resource "google_storage_bucket" "frontend_staging" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "vc-frontend-staging"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "index.html"
        }
    }

  # google_storage_default_object_access_control.public_access will be created
  + resource "google_storage_default_object_access_control" "public_access" {
      + bucket       = "vc-frontend-staging"
      + domain       = (known after apply)
      + email        = (known after apply)
      + entity       = "allUsers"
      + entity_id    = (known after apply)
      + generation   = (known after apply)
      + id           = (known after apply)
      + project_team = (known after apply)
      + role         = "READER"
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>